# Shell & terminal
brew "tmux"
brew "autossh"
brew "pinentry"

# Git & GitHub
brew "gnupg"
brew "gh"

# Cloud & infrastructure
brew "aws-vault"
brew "kubectx"

# Runtimes
brew "asdf"

# Casks
cask "iterm2"
cask "maccy"
cask "freelens"
cask "visual-studio-code"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"

# Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "charliermarsh.ruff"
vscode "ms-toolsai.jupyter"

# Infrastructure & Cloud
vscode "hashicorp.terraform"
vscode "4ops.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"

# Remote development
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"

# Data & databases
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "cweijan.vscode-postgresql-client2"
vscode "mechatroner.rainbow-csv"

# General
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "eriklynd.json-tools"
vscode "tomoki1207.pdf"
